first_routes_controllers/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-04-01 19:10:48.989906"], ["updated_at", "2021-04-01 19:10:48.989906"], ["username", "cheeseman"]]