first_routes_controllers/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        user = User.find(params[:id])

        if user.destroy